Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja2/milepel-s.htm.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 2 .
nob: Artikkel i boka Samisk skolehistorie 2 .

source: « Buot stuorámus olahus ealáhusa historjjás »
nob: « Den aller største milepæl i næringens historie »

source: Oasit boazodoallooahpus maid Svein Lund lea čohkken
nob: Trekk av reindriftsutdanningas historie samla av Svein Lund

source: Nie čálii Boazodoalloođđasat bláđđi dalle go boazodoalloskuvla álggahuvvui 1968:s [ Boazodoalloođđasat / Reindriftsnytt 3-1968 , s. 12 .
nob: « Dette må vel for reindriftssamene betegnes som den aller største milepæl i næringens historie » . Slik skreiv Reindriftsnytt [ Reindriftsnytt 3-1968 , s. 12 .

source: Artihkal lea doaimaheddji , Loyd Villmo , čállán . ]
nob: Artikkelen er skrevet av redaktøren , Loyd Villmo . ]

source: Skuvla bođii johtilit johtui , ja vuosttaš oahppit álge skuvlii juo jagi maŋŋel go NBR ' riikačoahkkin lei bidjan gáibádusa álggahit sierra boazodoalloskuvlla .
nob: Skolen kom svært raskt igang , de første elevene inntok skolen allerede året etter at landsmøtet i Norske reindriftssamers landsforbund ( NRL ) hadde reist krav om egen reindriftsskole .

source: Lea čállon hui unnán boazodoallooahpahusa historjjá birra .
nob: Det er skrevet svært lite om reindriftsutdanningas historie .

source: Boazodoalloskuvla lea válddahallon oanehis artihkkalis Sámi joatkkaskuvlla ja boazodoalloskuvlla ávvučállagis [ Sámi joatkkaskuvla ja boazodoalloskuvla : Árbevieruiguin ja oahpuin boahtteáigái .
nob: Reindriftsskolen er behandla i en kort artikkel i jubileumsskriftet for Samisk videregående skole og reindriftsskole [ Samisk videregående skole og reindriftsskole : Med tradisjoner og kunnskap inn i framtiden .

source: SJSBS 2002 . ] , muhto das čállo eanaš áigodagas maŋŋil sirdima Guovdageidnui 1981:s .
nob: SVSRS 2002 ] , men denne behandler hovedsakelig utviklinga etter flyttinga til Kautokeino i 1981 .

source: Mii leat danin geahččalan čohkket muhtin osiid ovdáneamis , vuosttažettiin ovdal oktiičaskima Sámi joatkkaskuvllain .
nob: Vi har derfor forsøkt å trekke fram noen trekk i utviklinga , med hovedvekt på tida før sammenslåing med Samisk videregående skole .

source: Dát dieđut leat čohkkejuvvon Boazodoalloođđasat bláđiid ja Romssa stáhtaarkiivva dokumeanttaid vuođul , ja maiddái skuvlla ovdalaš oahpaheddjiid dieđuid vuođul .
nob: Dette er basert på studier av Reindriftsnytt og dokumenter i Statsarkivet i Tromsø , samt opplysninger fra tidligere lærere ved skolen .

source: Man guhkás maŋos áiggis lea leamaš boazodoallooahppu ?
nob: Hvor langt tilbake har det vært reindriftsutdanning ?

source: Muhtimat oaivvildit ahte vuosttaš boazodoalloskuvla lei Jiepmaluovttas Álttá suohkanis .
nob: Noen hevder at den første reindriftsskolen var i Jiebmaluokta ( Hjemmeluft ) i Alta .

source: Doppe lea sin távval ain bistime .
nob: Der er tavla deres bevart .

source: Sis eai lean krihtat eaige guopparasat , nu ahte sii sárgo báktái .
nob: De hadde ikke kritt og svamp , så de rissa inn i berget .

source: Dan dihte leat nu ollu govat bohccuin , gárddiin , guolásteamis ja bivddus .
nob: Derfor er det så mange helleristninger av rein , reingjerde , fiske og fangst .

source: Buot dát leat ain oahppomearrin boazodoalloskuvllas .
nob: Alt dette er fortsatt pensum på reindriftsskolen .

source: Boazodoallooahpahus ruovttufidnoskuvllas ?
nob: Reindriftsopplæring ved Heimeyrkeskolen ?

source: Dalle go Stáhta ruovttufidnoskuvla sámiide álggahuvvui Guovdageidnui , lei boazodoallu buot stuorámus ealáhus suohkanis .
nob: På den tida Statens heimeyrkeskole for samer blei oppretta i Kautokeino , var reindrift den helt dominerende næringa i kommunen .

source: Guovdageainnu fidnoskuvlalávdegoddi buvttii guovvamánu 22. beaivve 1952:s evttohusa skuvlaplánii .
nob: Kautokeino yrkesskolenemnd kom 22. februar 1952 med et forslag til skoleplan .

source: Dás čuožžu bargooahpu vuolde čuokkis : « Dása gullá ekonomalaš ávkkásteapmi ovttaskas bohccos ja ealus , beananáliid náláštuhttin , boazodávddat , gálden , njuovvan , biergogieđahallan , guohtundilálašvuođas , mearkaregistreremis , boazodoallolágas ja soaitimis eanet . »
nob: Her heter det under punktet yrkeslære : « Herunder økonomisk utnytting av den enkelte rein og reinflokken , foredling av hunderaser , reinsykdommer , kastrering , slakting , behandling av kjøtt , beiteforhold , merkeregistrering , reindriftsloven og muligens mer . »

source: Liikká oaččui ieš boazodoallu unnán saji skuvllas .
nob: Likevel fikk sjølve reindrifta i praksis en beskjeden plass i skolen .

source: Ruovttufidnoskuvla attii vuosttažettiin oahpahusa liigeealáhusain maid sáhtii ovttastit boazodoaluin , nugo iešguđetlágán metálla- , muorra- ja čoarveduojis , náhkkedikšumis , goarrumis ja čuoldimis .
nob: Heimeyrkeskolen ga i første rekke opplæring i binæringer som kunne kombineres med reindrift , som forskjellige former for metall- , tre- og hornsløyd , skinnberedning , søm og vev .

source: Boazodoallu variántan gilvvagárdedoalus
nob: Reindrift som variant av hagebruk

source: Stáhta boazodoalloskuvla álggahuvvui 1968:s Borkenesas Giehtavuonas Lulli-Romssas .
nob: Statens reindriftsskole blei oppretta i 1968 på Borkenes i Kvæfjord i Sør-Troms .

source: Nama bokte orru dát skuvla leamaš sierra skuvlan , muhto duohtavuođas lei okta suorgi Stáhta gilvvagárdeskuvllas . ( Álggos lei almmolaš namma Statens hagebruksskole , maŋŋel Statens gartnerskole ) .
nob: Etter navnet å dømme var reindriftsskolen en sjølstendig skole , men i praksis var den heller ei linje under Statens hagebruksskole ( seinere Statens gartnerskole ) .

source: Boazodoallooahpahus gulai gilvvagárdeskuvlla rektora ja stivrra vuollái . Stivra viididuvvui guvttiin áirasiin , vai boazodoalu beroštumit váldojuvvojit vuhtii .
nob: Reindriftsutdanninga var underlagt hagebruksskolens rektor og styre , som blei utvida med to representanter for å ivareta reindriftsinteressene .

source: Boazodaolloskuvllas lei dušše okta sierra oahpaheaddji , mas lei ámmátnamma boazodoalu badjeoahpaheaddji .
nob: Reindriftsskolen hadde bare en egen lærer , med tittel av overlærer i reindrift .

source: Máŋgga fágas ožžo boazodoallooahppit oahpahusa gilvvagárdeskuvlla oahpaheddjiin , muhtomin lei maid oktasaš oahpaheapmi boazodoallo- ja gilvvagárdeskuvlla ohppiin .
nob: I mange fag blei reindriftselevene undervist av lærerne fra hagebruksskolen , til dels med fellesundervisning i store klasser med både reindrifts- og hagebrukselever .

source: Lei jur dan nalde ahte ožžo geavahit nama Stáhta boazodoalloskuvla .
nob: Sjøl navnet Statens reindriftsskole var det så vidt at man fikk bruke .

source: Vuosttaldeapmi bođii Finánsadepartemeanttas ( ! )
nob: Det møtte motstand fra Finansdepartementet ( ! )

source: mii celkkii : « ... dás guvlui ii leat dárbu eará nammii kursafálaldahkii go boazodoallokursa » .
nob: . som uttalte at « – det inntil videre ikke er grunn til å gi kursvirksomheten annen betegnelse enn reindriftskurs » .

source: 1 Dan vuosttaldii skuvlla fágastivra ja čálii Eanandoallodepartementii : " ... Mii ballat ahte namahus boazodoallokursa addá ohppiide ja ealáhusa olbmuide heajos iešdovddu maiddái dás , ja dat árvideames ii leat leamaš departemeantta oaivil » .
nob: Da protesterte skolens fagstyre og skreiv til Landbruksdepartementet : « . . Vi er redd for at betegnelsen reindriftskurs kan gi elevene og næringens folk en følelse av mindreverdighet også på dette felt , og det har vel neppe vært departementets mening.»[Brev av 30.10.1968 : Reindriftskurset – navnespørsmålet .

source: De vástidii Eanandoallodepartemeanta : « Departemeanttas ii leat mihkke vuosteháguid dasa ahte doaibma mii addá boazodoallooahpu , gohčoduvvo Stáhta boazodoalloskuvlan».[Reive 30.10.1968 : Reindriftskurset – navnespørsmålet . Gáldu : Statens gartnerskole arkiiva , Romssa stáhtaarkiivas . ]
nob: Da svarte Landbruksdepartementet : « Departementet har ikke noe å innvende mot at den virksomheten som gjelder reindriftsopplæringen blir gitt betegnelsen Statens reindriftsskole.»[Brev av 22.11.1968 : Kilde : Arkiv for Statens gartnerskole , Statsarkivet i Tromsø . ]

source: Go boazodoalloskuvla lei gilvvagárdeskuvllas , de dat váikkuhii oahpahussii .
nob: Når reindriftsskolen var plassert på en hagebruksskole , blei mye av undervisninga prega av det .

source: Dát govva lea muhtin gilvvavisttis , uvssas lea boazodoallooahpaheaddji Per Holm Varsi bárdni .
nob: Her fra et av drivhusa på skolen , i døra sønnen til reindriftslærer Per Holm Varsi .

source: ( Govva : Peer Gaup )
nob: ( Foto : Peer Gaup )

source: Borkenesa internáhtas .
nob: Fra internatet på Borkenes .

source: Gurut bealde John Brekkfjell ja Peer Gaup .
nob: Fra venstre John Brekkfjell og Peer Gaup .

source: ( Gova luoikan Peer Gaup )
nob: ( Foto utlånt av Peer Gaup )

source: Oahpaheaddjiváilevuohta
nob: Lærermangel

source: Álggu rájes lea juo leamaš váttis gávdnat oahpaheddjiid , geain lea sihke alit oahppu eanandoalus ja pedagogihkas , ja geat bures dovdet boazodoalu .
nob: Fra starten har det vært vanskelig å finne lærere med både høyere landbruksutdanning , pedagogisk utdanning og god kjennskap til reindrifta .

source: Vuosttaš almmuheami maŋŋel ii ohcan oktage bargui , muhto Paul Fjellheim , gii lei šibitdoavttir ja maiddái NBR ' jođiheaddji , mieđihii váldit oahpaheaddjibarggu vuosttaš jagi .
nob: Ved første utlysning kom det ingen søkere , men Paul Fjellheim , som var veterinær og samtidig leder i Norske reindriftssamers landsforbund ( NRL ) , lot seg overtale til å ta på seg lærerjobben for det første skoleåret .

source: Maŋit jagi álggii Per Holm Varsi váldooahpaheaddjin .
nob: Andre året begynte Per Holm Varsi som hovedlærer .

source: Son lei sivilagronoma , lei eanandoallobirrasis Deanus , ja muhtin oahppit oaivvildedje ahte son ii máhttán nu ollu praktihkalaš boazodoalu .
nob: Han var sivilagronom , fra jordbruksmiljø i Tana , og noen av elevene mente at han ikke kunne så mye om praktisk reindrift .

source: Lihkká barggai son buori barggu skuvllas , ja lei doppe gitta 1974 ' rádjái . Dalle son álggii Finnmárkku eanandoalloskuvlla rektorin .
nob: Likevel gjorde han en stor innsats for skolen og var der til 1974 , da han blei rektor ved Finnmark landbruksskole .

source: Maŋŋel go son heittii , de ii lean vejolaš oažžut dohkálaš oahpaheaddji skuvlii .
nob: Etter at han slutta var det ikke mulig å få tak i kvalifisert lærer .

source: Danne ii lean oahpaheaddji boazodoalus skuvlajagi 1974/75 .
nob: Skoleåret 1974/75 var det derfor ingen lærer i reindrift .

source: Boazodoalloskuvla 1974/75 : Dušše 4 oahppi ja ii oktage albma boazodoallooahpaheaddji .
nob: Reindriftsskolen 1974/75 : Bare 4 elever og ingen egentlig reindriftslærer .

source: Oahpaheaddjit : John Hovd , gilvvagárdedoalu váldooahpaheaddji , Albrigt Myrstad , rektor , Idar Hunstad , eanandoalu váldooahpaheaddji ja John J. Nordfjell , boazodoalu kursajođiheaddji .
nob: Lærere : John Hovd , overlærer i hagebruk , Albrigt Myrstad , rektor , Idar Hunstad , overlærer i jordbruk og John J. Nordfjell , kursleder reindrift .

source: Oahppit : Nelly Stenfjell , Annar Nordfjell , Johan Ingvald Sara , Isak Isaksen Eira .
nob: Elever : Nelly Stenfjell , Annar Nordfjell , Johan Ingvald Sara , Isak Isaksen Eira .

source: ( Gova luoikan SJSBS )
nob: ( Foto utlånt av SVSRS )

source: 1975 ' čavčča nammaduvvui Jens Halvdan Mosli virgái .
nob: Høsten 1975 blei så Jens Halvdan Mosli tilsatt .

source: Son lei vázzán eanandoalloallaskuvlla , muhto sus ii lean nu ollu gelbbolašvuohta boazodoalus .
nob: Han hadde landbrukshøgskole , men begrensa kunnskaper om reindrift .

source: Danin oaččui son stipendiáhttajagi oahpásnuvvat boazodoalloáššiide ovdalgo álggii oahpaheaddjin 1976:s .
nob: Derfor fikk han et år som stipendiat til å sette seg inn i reindriftsspørsmål før han begynte å undervise i 1976 .

source: Son lei dán barggus gitta 1980 ' rádjái .
nob: Han blei i jobben til 1980 .

source: Go son heittii , de ii ohcan oktage boazodoallooahpaheaddjin .
nob: Da han slutta var det ingen som søkte på stillingen som overlærer i reindrift .

source: Das lei boađusin ahte ii lean kursa oahppojagi 1980/81 .
nob: Resultatet var at det ikke blei noe kurs i 1980/81 .

source: Boazodoalloođđasat
nob: Reindriftsnytt

source: Okta dain deháleamos neavvuin oažžut dieđihit boazodoalloskuvlla birra , lei Boazodoalloođđasat / Reindriftsnytt - bláđđi , maid stáhtakonsuleanta Loyd Villmo doaimmahii ja buorre muddui čálii .
nob: Et av de viktigste midlene for å få ut informasjon om reindriftsskolen var bladet Reindriftsnytt , som blei redigert og i stor grad skrevet av statskonsulent Loyd Villmo .

source: Sullii juohke nuppi nummaris lei juoga skuvlla birra .
nob: I omtrent annet hvert nummer sto det noe om skolen .

source: Boazodoalloođđasat - dološ ja ođđa áiggis
nob: Reindriftsnytt - fra gammel og nyere tid

source: Nummaris 2-70 muitaluvvo ohppiid ekonomalaš eavttuid birra : « Ekonomalaš bealli ohppiide orro dál čoavdašuvvame bures .
nob: I nr. 2-70 fortelles det om de økonomiske vilkåra for elevene : « Den økonomiske siden for elevene synes nå å løses bra .

source: Maŋemus jagi oahppit leat ožžon buot nuvttá skuvllas .
nob: Det siste årskull har hatt alt gratis på skolen .

source: Sis , geain leat alddiineaset bohccot , ja geat leat šaddan bálkáhit soapmása daid guođohit dan botta go ieža vázzet skuvlla , leat ožžon stáhtadoarjaga guođohanveahkkái . »
nob: De som har rein sjøl , slik at de må leie noen til å ta seg av denne mens de går på skolen , har fått statstilskudd til gjeterhjelp . »

source: Jagi maŋŋel fállojuvvo nuvttá mátki skuvlla ja ruovttu gaskkas .
nob: Året etter reklameres det i tillegg med fri reise til og fra skolen .

source: Moadde jagi maŋŋel čálii bláđđi : « Ii leat várra oktage eará skuvla Norggas mas lea nu stuora ekonomalaš doarjja ohppiide go boazodoalloskuvllas . »
nob: Et par år seinere skreiv bladet : « Det er neppe noen annen skole her i landet som har så stor økonomisk støtte til elevene som reindriftsskolen . »

source: Boazodoalloođđasat-bláđis čálle dávjá iešguđetlágán fealtakurssaid ja olgomátkkiid birra mat skuvllas ledje .
nob: Reindriftsnytt skreiv stadig om de forskjellige feltkurs og ekskursjoner som skolen hadde .

source: Dás dahkkui maid dovddusin jus muhtin ovdalaš oahppi jotkkii eará skuvllaide , nugo meahcástanteknihkarohppui dahje eanandoalloallaskuvlii .
nob: Her blei det også gjort kjent når enkelte av reindriftsskolens tidligere elever fortsatte på andre skoler , som utmarksteknikerutdanning eller landbrukshøgskolen .

source: Nu guhká go Villmo doaimmahii Boazodoalloođđasat-bláđi , 1979 rádjái , de lei bláđis ollu skuvlla birra ja go doaimmaheaddji dovddai skuvlla bures , de šadde maid čállosat jáhkehahttin .
nob: Så lenge Villmo redigerte Reindriftsnytt , til 1979 , hadde bladet ei jevn dekking av skolen og siden redaktøren kjente skolen godt , blei dekkinga også pålitelig .

source: Eará ášši lea ahte soittii šaddat veahá eahpekritihkalaččat , go son háliidii geavahit bláđi dasa ahte oččodit eambbo ohppiid skuvlii , ja de lei dehálaš skuvlla rámpot .
nob: Ei annen sak er at den kanskje blei litt ukritisk , fordi han ville bruke bladet til å rekruttere framtidige elever , og dermed blei det viktig å stille skolen i et godt lys .

source: Maŋŋel ii lean šat nu lagas oktavuohta Boazodoalloođđasat-bláđi ja skuvlla gaskas .
nob: Seinere blei det mindre nær kontakt mellom Reindriftsnytt og skolen .

source: Dát mielddisbuvttii muhtin áiggiid eanet kritihkalaš čállosiid , muhto maiddái čállosiid main vuhttui unnán máhttu diliid birra .
nob: Det kunne i perioder føre til mer kritiske artikler , men også artikler som bar preg av liten kjennskap til forholda .

source: Sirdin Finnmárkui
nob: Flytting til Finnmark

source: Vaikko ollu oahppit celke vuosttaš jagiid ahte sii loktet áiggi bures Borkenesas , de bohte áiggi mielde garrasit aht ` garrasit gáibádusat sirdit skuvlla , sihke ohppiin , oahpaheddjiin ja boazodoalloealáhusas .
nob: Sjøl om mange elever de første åra uttrykte at de trivdes på Borkenes , kom det etter hvert sterkere og sterkere krav om flytting av skolen , både fra elever , lærere og fra reindriftsnæringa .

source: 1973:s čálle oahppit ávžžuhusa buot NBR ' báikkálaš servviide ja bivde sin bargat dainna ahte sirdit skuvlla eret Borkenesas .
nob: I 1973 forfatta elevene et opprop til alle lokallag i NRL og ba dem gå inn for å få flytta skolen fra Borkenes .

source: 1977:s nammadii Eanandoallodepartemeanta lávdegotti , mii galggai ráhkadit ođđa skuvlaplána Stáhta boazodoalloskuvlla várás .
nob: I 1977 oppnevnte Landbruksdepartementet et utvalg for å utrede ny skoleplan for Statens reindriftsskole .

source: Lávdegoddi evttohii 1979:s viiddidit skuvlafálaldagaid vai šaddá jagi vuođđokursa , jagi fágakursa , sihke reivekursa / fágaskuvla ja oanehit kurssat .
nob: Utvalget foreslo våren 1979 ei utbygging med 1-årig grunnkurs , 1-årig fagkurs , kombinert brevkurs / fagskole og kortere kurs .

source: Goitge vásse jagit ovdalgo dáhpáhuvai nu ollu dáinna áššiin .
nob: Det skulle likevel gå mange år før det skjedde noe særlig med dette .

source: Vuosttaš jagiid lei skuvllas doarvái ceavzit .
nob: De første åra hadde skolen nok med å overleve .

source: Lávdegoddi lei ovttaoaivilis ahte skuvla galggašii sirdojuvvot , muhto eai lean ovttaoaivilis gosa galge sirdit dan .
nob: Utvalget var enig om at skolen burde flyttes , men ikke om hvor den skulle flyttes .

source: 1981 álggus ledje Boazodoalloođđasat-bláđis máŋga čállosa boazodoalloskuvlla birra .
nob: I begynnelsen av 1981 hadde Reindriftsnytt flere artikler om reindriftsskolen .

source: Bláđđi cuiggoda vuosttažettiin Eanandoallodepartemeantta , mii ii leat velge nagodan maidege mearridit mii guoská skuvlla boahtteáigái .
nob: Bladet kritiserer i første rekke Landbruksdepartementet , som ennå ikke har klart å avgjøre noe når det gjelder framtida til skolen .

source: Sii oaivvildit ahte sivvan go ii oktage leat ohcan guoros oahpaheaddjivirgái , lea eahpečielggasvuohta skuvlla sirdimis ja makkár fálaldagaid galget fállat doppe .
nob: Man mener at uklarhet om flytting av skolen og hvilke tilbud som skal gis er ei viktig årsak til at ingen ville søke den ledige lærerstillinga .

source: Giđđat 1981:s mearridii Eanandoallodepartemeanta ahte skuvla galgá sirdojuvvot Guovdageidnui , muhto geassemánu čálii departemeanta Boazodoallohálddahussii ahte rehkenastet láigohit lanjaid birasviesus ja eaktun lea ahte Jens H. Mosli váldá badjelasas álggaheami ja oahpaheami .
nob: Våren 1981 avgjorde Landbruksdepartementet at skolen skulle flyttes til Kautokeino , men så seint som i juni skriver departementet til Reindriftsadministrasjonen at man regner med å leie lokaler i miljøbygget og at det er en forutsetning at Jens H. Mosli påtar seg igangsetting og undervisning .

source: Čájehuvvui ahte dát eavttut eai dollojuvvon .
nob: Ingen av disse forutsetningene skulle vise seg å holde .

source: Son gii maŋemus oaččui ovddasvástádusa čađahit sirdima ja bidjat johtui boazodoalloskuvlla Guovdageidnui , lei Ing-Lill Pavall , gii lei boazodoallobirrasis Nordlánddas ja aiddo lei geargan eanandoalloallaskuvllas .
nob: Den som til sist fikk ansvaret for å gjennomføre flyttinga og sette i gang reindriftsskolen i Kautokeino var Ing-Lill Pavall , som kom fra reindriftsmiljø i Nordland og nettopp var uteksaminert fra landbrukshøgskolen .

source: Boazodoalloskuvla galggai oažžut saji Sámi joatkkaskuvllas , muhto doppe ii lean guoros sadji ja skuvlla ledje stuorideame .
nob: Reindriftsskolen skulle få plass på Samisk videregående skole , men her var det ingen ledig plass og skolen var under utbygging .

source: Vuosttaš jagi álggahuvvui boazodoallooahpahus maŋŋit čakčat , Duottarstobu jođiheaddjiviesus .
nob: Første året starta derfor reindriftsundervisninga opp seint på høsten , i bestyrerboligen på Fjellstua .

source: Boazodoalloskuvla vuosttaš jagi maŋŋil sirdima Guovdageidnui .
nob: Reindriftsskolen første året etter flyttinga til Kautokeino .

source: Gurut bealde : Ragnhild S. Hætta , Aslak E. Utsi , Ing-Lill Pavall ( lektor ) , Ole Einar Olsen ( rektor ) , Ann Mari Steinfjell , Per O. Sara , Odd Bjørnar Bjørkås , Marit M. Fjellheim , Inge E. Danielsen , Nils Mikkel M. Buljo , Isak O. Oskal , Rolf G. Sarre .
nob: Fra venstre : Ragnhild S. Hætta , Aslak E. Utsi , Ing-Lill Pavall ( lektor ) , Ole Einar Olsen ( rektor ) , Ann Mari Steinfjell , Per O. Sara , Odd Bjørnar Bjørkås , Marit M. Fjellheim , Inge E. Danielsen , Nils Mikkel M. Buljo , Isak O. Oskal , Rolf G. Sarre .

source: Sajihisvuohta ja gižžu
nob: Trengsel og konflikter

source: Jus vel fárren ii mannan ge bárttiid haga , de mielddisbuvttii goit ahte ohcamat boazodoalu fágakursii lassánedje ollu .
nob: Om flyttinga ikke skjedde uten problemer , førte den i alle fall til at søkninga av elever til fagkurset i reindrift tok seg kraftig opp .

source: Erenoamážit Guovdageainnus ja eará Finnmárkku boazodoallosuohkaniin ledje dál ollu eanet geat sávve váldit boazodoallooahpu .
nob: Særlig fra Kautokeino og andre reindriftskommuner i Finnmark var det nå langt flere som ønska å ta reindriftsutdanning .

source: Sámi joatkkaskuvlla huksen lei plánejuvvon ovdalgo mearridedje sirdit boazodoalloskuvlla , nu ahte ii šaddan gal nu olu buoret sadji boazodoalloskuvlii go joatkkaskuvlla ođđa visti válbmanii 1982:s .
nob: Utbygginga av Samisk videregående skole var planlagt før vedtaket om flytting av reindriftsskolen , så det blei ikke så mye mer plass for reindriftskolen da nybygget til den videregående skolen sto ferdig i 1982 .

source: Go boazodoalloskuvla fárrii sisa dien čavčča , de šattai fargga riidu luohkkálanjaid ja eará lanjaid nalde .
nob: Da reindriftsskolen flytta inn den høsten , blei det raskt konflikter om klasserom og andre lokaler .

source: Boazodoalloskuvllas ledje álggu rájes hui unnán resurssat , ja dušše okta oahpaheaddjivirgi ( ! )
nob: Reindriftsskolen hadde fra starten svært små ressurser , og bare ei lærerstilling ( ! )

source: gitta 1983 ' rádjái .
nob: fram til 1983 .

source: Dalle viiddiduvvui guovtti oahpaheaddjái , muhto skuvllas ii lean vel dohkkehuvvon oahppoplána iige oktage dohkkehuvvon oahppogirji .
nob: Da blei det utvida til to stillinger , men skolen hadde fremdeles verken godkjent læreplan eller ei eneste godkjent lærebok .

source: 1982 ' rájes lei skuvllain oktasaš rektor , muhto goabbat stivra ja leigga goabbat departemeantta vuolde .
nob: Fra 1982 hadde skolene felles rektor , men de hadde hvert sitt styre og lå under hvert sitt departement .

source: Nuppi bealis dáhtui boazodoalloskuvla alcces sierra skuvlla .
nob: På den ene sida ønska reindriftsskolen en egen skole .

source: Nuppe dáfus fas bivddii Sámi joatkkaskuvlla stivra 1985:s Oahpahusdepartemeantta cealkit eret láigošiehtadusa Stáhta boazodoalloskuvllain .
nob: På den andre sida ba styret for Samisk videregående skole i 1985 utdanningsdepartementet si opp leieavtalen med Statens reindriftsskole .

source: 1986:s válddii oktasaš rektor virgelobi jahkái , ja oahpaheaddjiorganisašuvnnat mearridedje de caggat virggi nu guhká go okta rektor lei biddjon jođihit guokte skuvlla .
nob: I 1986 skulle den felles rektoren ha et års permisjon og lærerorganisasjonene vedtok da å blokkere stillingen så lenge en rektor var pålagt å lede to skoler .

source: Boađus šattai ahte boazodoalloskuvla oaččui sierra rektora , muhto guokte jagi maŋŋel biddjojuvvoje goitge dát guokte skuvlla oktii .
nob: Det endte med at reindriftsskolen fikk egen rektor , men to år etter blei skolene likevel slått sammen til en skole .
